diy_data_harvester/ndw_harvester/data/gebeurtenisinfo.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"><SOAP:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><exchange><supplierIdentification><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></supplierIdentification><subscription><operatingMode>operatingMode3</operatingMode><subscriptionStartTime>2021-10-20T11:04:23.426Z</subscriptionStartTime><subscriptionState>active</subscriptionState><updateMethod>snapshot</updateMethod><target><address/><protocol>HTTP</protocol></target></subscription></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="SituationPublication" lang="nl"><publicationTime>2021-11-19T07:48:14.021Z</publicationTime><publicationCreator><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></publicationCreator><situation id="NLRWS_0002906794" version="1"><overallSeverity>lowest</overallSeverity><situationVersionTime>2021-11-19T07:43:37Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="AbnormalTraffic" id="NLRWS_0002906794_1" version="1"><situationRecordCreationReference>NLSIT16593590</situationRecordCreationReference><situationRecordCreationTime>2021-11-19T07:43:00Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-19T07:43:37Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">NLRWS</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-19T07:43:00Z</overallStartTime><validPeriod><startOfPeriod>2021-11-19T07:43:00Z</startOfPeriod></validPeriod></validityTimeSpecification></validity><impact><delays><delayBand>upToTenMinutes</delayBand><delayTimeValue>92.0</delayTimeValue></delays></impact><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>51.976383</latitude><longitude>5.9632664</longitude></locationForDisplay><supplementaryPositionalDescription/><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>8879</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>8874</specificLocation></alertCLocation><offsetDistance><offsetDistance>600</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>51.95636</latitude><longitude>5.9293747</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>51.976383</latitude><longitude>5.9632664</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><abnormalTrafficType>slowTraffic</abnormalTrafficType><queueLength>3000</queueLength></situationRecord></situation><situation id="NLRWS_0002906797" version="1"><overallSeverity>lowest</overallSeverity><situationVersionTime>2021-11-19T07:47:56.759574Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="GeneralObstruction" id="NLRWS_0002906797_1" version="1"><situationRecordCreationTime>2021-11-19T07:47:56.759574Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-19T07:47:56.759574Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">NLRWS</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-19T07:47:56.759574Z</overallStartTime><validPeriod><startOfPeriod>2021-11-19T07:47:56.759574Z</startOfPeriod></validPeriod></validityTimeSpecification></validity><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>51.536983</latitude><longitude>4.740819</longitude></locationForDisplay><supplementaryPositionalDescription/><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>7595</specificLocation></alertCLocation><offsetDistance><offsetDistance>3400</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>7591</specificLocation></alertCLocation><offsetDistance><offsetDistance>1800</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>51.536983</latitude><longitude>4.740819</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>51.536983</latitude><longitude>4.740819</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>unknown</mobilityType></mobilityOfObstruction><obstructionType>spillageOnTheRoad</obstructionType></situationRecord></situation><situation id="NLRWS_0002906796" version="1"><overallSeverity>lowest</overallSeverity><situationVersionTime>2021-11-19T07:47:56.085020Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="GeneralObstruction" id="NLRWS_0002906796_1" version="1"><situationRecordCreationTime>2021-11-19T07:47:56.085020Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-19T07:47:56.085020Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">NLRWS</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-19T07:47:56.085020Z</overallStartTime><validPeriod><startOfPeriod>2021-11-19T07:47:56.085020Z</startOfPeriod></validPeriod></validityTimeSpecification></validity><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>51.68198</latitude><longitude>4.663488</longitude></locationForDisplay><supplementaryPositionalDescription/><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>7605</specificLocation></alertCLocation><offsetDistance><offsetDistance>100</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>7605</specificLocation></alertCLocation><offsetDistance><offsetDistance>800</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>51.68198</latitude><longitude>4.663488</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>51.68198</latitude><longitude>4.663488</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><mobilityOfObstruction><mobilityType>unknown</mobilityType></mobilityOfObstruction><obstructionType>objectOnTheRoad</obstructionType></situationRecord></situation><situation id="NLRWS_0002906753" version="3"><overallSeverity>lowest</overallSeverity><situationVersionTime>2021-11-19T06:49:58.186216Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="RoadOrCarriagewayOrLaneManagement" id="NLRWS_0002906753_1" version="3"><situationRecordCreationTime>2021-11-19T01:27:32.012506Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-19T06:49:58.186216Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">NLRWS</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-19T01:27:32.012506Z</overallStartTime><validPeriod><startOfPeriod>2021-11-19T01:27:32.012506Z</startOfPeriod></validPeriod></validityTimeSpecification></validity><cause xsi:type="NonManagedCause"><causeDescription><values><value lang="nl">Gekantelde vrachtwagen</value></values></causeDescription><causeType>other</causeType></cause><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>51.858765</latitude><longitude>5.2824244</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>exitSlipRoad</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>7488</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>7488</specificLocation></alertCLocation><offsetDistance><offsetDistance>400</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>51.858765</latitude><longitude>5.2824244</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>51.858765</latitude><longitude>5.2824244</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><operatorActionStatus>implemented</operatorActionStatus><complianceOption>mandatory</complianceOption><roadOrCarriagewayOrLaneManagementType>carriagewayClosures</roadOrCarriagewayOrLaneManagementType></situationRecord></situation><situation id="RWS02_0000361770" version="5"><overallSeverity>medium</overallSeverity><situationVersionTime>2021-11-19T07:45:09Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361770_361770" version="5"><situationRecordCreationTime>2021-11-19T07:38:09Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-19T07:45:09Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-19T07:38:09Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Point"><locationForDisplay><latitude>51.5570068</latitude><longitude>4.456595</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCPoint xsi:type="AlertCMethod4Point"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>7705</specificLocation></alertCLocation><offsetDistance><offsetDistance>500</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation></alertCPoint><pointByCoordinates><pointCoordinates><latitude>51.5570068</latitude><longitude>4.456595</longitude></pointCoordinates></pointByCoordinates></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>stationary</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation><situation id="RWS02_0000361772" version="2"><overallSeverity>medium</overallSeverity><situationVersionTime>2021-11-19T07:48:12Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361772_361772" version="2"><situationRecordCreationTime>2021-11-19T07:47:09Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-19T07:48:12Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-19T07:47:09Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>50.8860931</latitude><longitude>5.73936</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>7855</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>22252</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>50.87433</latitude><longitude>5.732734</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>50.89221</latitude><longitude>5.745221</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>mobile</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation><situation id="RWS02_0000361773" version="1"><overallSeverity>medium</overallSeverity><situationVersionTime>2021-11-19T07:48:11Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361773_361773" version="1"><situationRecordCreationTime>2021-11-19T07:48:09Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-19T07:48:11Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-19T07:48:09Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Point"><locationForDisplay><latitude>52.21032</latitude><longitude>6.813305</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCPoint xsi:type="AlertCMethod4Point"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>9014</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation></alertCPoint><pointByCoordinates><pointCoordinates><latitude>52.21032</latitude><longitude>6.813305</longitude></pointCoordinates></pointByCoordinates></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>stationary</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation></payloadPublication></d2LogicalModel></SOAP:Body></SOAP:Envelope>